updated docs and readme
